## Data

In [1]:
import pandas as pd

In [2]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [3]:
student_df = pd.DataFrame(students)

## Map

* Series'lerde çalışır

In [4]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [5]:
student_df["name"]

0    Finley
1    Andrew
2     Blake
3     Denis
Name: name, dtype: object

In [5]:
student_df["name"].map({"finley":"Jane"})

0    NaN
1    NaN
2    NaN
3    NaN
Name: name, dtype: object

In [6]:
student_df["name"].map({"Finley":"Jane"}) #mapta hepsini belirtmek zorundayız. belirtmezssek diğerleri none olarak gelir.

0    Jane
1     NaN
2     NaN
3     NaN
Name: name, dtype: object

In [6]:
student_df["name"].map({"Finley":"Jane", "Andrew":"Hughes"})

0      Jane
1    Hughes
2       NaN
3       NaN
Name: name, dtype: object

## Replace

* Sadede "finley" görünce etki etsin yoksa etki etmesin istiyorsam:

In [4]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [5]:
student_df["name"]

0    Finley
1    Andrew
2     Blake
3     Denis
Name: name, dtype: object

In [6]:
student_df["name"].replace({"finley":"Jane"})

0    Finley
1    Andrew
2     Blake
3     Denis
Name: name, dtype: object

In [7]:
student_df["name"].replace({"Finley":"Jane"}) # student_df["name"] = student_df["name"].replace({"Finley":"Jane"})

0      Jane
1    Andrew
2     Blake
3     Denis
Name: name, dtype: object

In [8]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1